# GetColorChoice

## Description
Get current choice for color popup dialog control.

```pascal
PROCEDURE GetColorChoice(
				dialogID       : LONGINT;
				itemID         : LONGINT;
				VAR colorIndex : INTEGER);
```

```python
def vs.GetColorChoice(dialogID, itemID):
    return colorIndex
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|   |
|itemID|LONGINT|   |
|colorIndex|INTEGER|   |

## Examples
lorPopupDialog}}

## Version
Availability: from VectorWorks12.0

## Category
* Dialogs - Modern